<?php

return [
    'booking' => [
        'list' => 'تم جلب الحجوزات بنجاح.',
    ],
    'break' => [
        'created' => 'تم إنشاء الاستراحة بنجاح.',
        'updated' => 'تم تحديث الاستراحة بنجاح.',
        'deleted' => 'تم حذف الاستراحة بنجاح.',
    ],
    'category' => [
        'list' => 'تم جلب التصنيفات بنجاح.',
        'created' => 'تم إنشاء التصنيف بنجاح.',
        'updated' => 'تم تحديث التصنيف بنجاح.',
    ],
    'client' => [
        'list' => 'تم جلب العملاء بنجاح.',
        'referral_added' => 'تم إضافة الإحالة بنجاح.',
    ],
    'page' => [
        'updated' => 'تم تحديث الصفحة بنجاح.',
    ],
    'post' => [
        'created' => 'تم إنشاء المقال بنجاح.',
        'updated' => 'تم تحديث المقال بنجاح.',
        'deleted' => 'تم حذف المقال بنجاح.',
    ],
    'product' => [
        'created' => 'تم إنشاء المنتج بنجاح.',
        'updated' => 'تم تحديث المنتج بنجاح.',
    ],
    'service' => [
        'listed'  => 'تم جلب الخدمات بنجاح.',
        'created' => 'تم إنشاء الخدمة بنجاح.',
        'updated' => 'تم تحديث الخدمة بنجاح.',
        'deleted' => 'تم حذف الخدمة بنجاح.',
    ],
    'staff' => [
        'list' => 'تم جلب الموظفين بنجاح.',
        'created' => 'تم إضافة الموظف بنجاح.',
        'updated' => 'تم تحديث بيانات الموظف بنجاح.',
        'deleted' => 'تم حذف الموظف بنجاح.',
        'restored' => 'تم تفعيل المستخدم بنجاح.',
    ],
    'subservice_item' => [
        'deleted' => 'تم حذف عنصر الخدمة الفرعية بنجاح.',
    ],
    'subservice' => [
        'created' => 'تم إنشاء الخدمة الفرعية بنجاح.',
        'updated' => 'تم تحديث الخدمة الفرعية بنجاح.',
        'deleted' => 'تم حذف الخدمة الفرعية بنجاح.',
    ],
    'working_hours' => [
        'updated' => 'تم تحديث ساعات العمل بنجاح.',
    ],
    'auth' => [
        'register_verify_email' => 'تم التسجيل بنجاح. يرجى تأكيد بريدك الإلكتروني.',
        'logged_in' => 'تم تسجيل الدخول بنجاح.',
        'logged_out' => 'تم تسجيل الخروج بنجاح.',
        'token_refreshed' => 'تم تحديث رمز الدخول بنجاح.',
    ],
    'password' => [
        'reset_link_sent' => 'تم إرسال رابط إعادة التعيين بنجاح.',
        'reset_done' => 'تم تغيير كلمة المرور بنجاح.',
    ],

];
